/*  Created on 7 03 2023 ?., 20:39
 */

#ifndef CANOPEN_LITE_H
#define	CANOPEN_LITE_H

#ifdef	__cplusplus
extern "C" {
#endif


#include <stdint.h> 
#include <stdio.h>

#include "CANOPEN.h"

	
#define  txSDO  0x580
#define  rxSDO  0x600

#define  txPDO1 0x180
#define  txPDO2 0x280 
#define  txPDO3 0x380
#define  txPDO4 0x480 
	
#define  rxPDO1 0x200
#define  rxPDO2 0x300
#define  rxPDO3 0x400
#define  rxPDO4 0x500



// deftype	
	
#define boolean         0x01
#define INT8            0x02
#define INT16           0x03
#define INT32           0x04
#define UINT8           0x05
#define UINT16          0x06
#define UINT32          0x07
#define REAL32          0x08
#define VISIBLE_STRING	0x09
#define OCTET_STRING	0x0A
#define UNICODE_STRING	0x0B
#define TIME_OF_DAY     0x0C
#define TIME_DIFFERENCE	0x0D

#define DOMAIN		0x0F
#define INT24		0x10
#define REAL64		0x11
#define INT40		0x12
#define INT48		0x13
#define INT56		0x14
#define INT64		0x15
#define UINT24		0x16

#define UINT40		0x18
#define UINT48		0x19
#define UINT56		0x1A
#define UINT64		0x1B

#define PDO_COMM        0x20
#define PDO_MAPPING     0x21
#define SDO_PARAMETER	0x22
#define IDENTITY	0x23
	
/*Object Dictionary TYPE Definitions cia301*/
#define OD_NULL 0
/* Large variable amount of data e.g. executable program code */
#define OD_DOMAIN 2
/*A multiple data field object where the data fields may be any combination of
simple variables. Sub-index 0 is of UNSIGNED8 and sub-index 255 is of
UNSIGNED32 and therefore not part of the RECORD data */
#define OD_RECORD 9
/* Defines a new record type e.g. the PDO mapping structure at 21h*/
#define OD_DEFSTRUCT 6
/* Denotes a type definition such as a BOOLEAN, UNSIGNED16, FLOAT and so on*/
#define OD_DEFTYPE 5
/* A single value such as anUNSIGNED8, BOOLEAN, FLOAT,INTEGER16, VISIBLE STRING etc.*/
#define OD_VAR  7	
/* A multiple data field object where each data field is a simple variable of
the SAME basic data type e.g. array of UNSIGNED16 etc. Sub-index 0 is
of UNSIGNED8 and therefore not part of the ARRAY data*/
#define OD_ARRAY 8

/*Attribute*/	

#define _CONST	0
#define RO      0b001
#define WO      0b010
#define RW      0b011
#define NO_MAP  0b10000000


/* structure */
	
#define SDO_request  0
#define MAP_info     1
	
struct Data_Object{
    
    uint8_t     request_type;
    uint8_t     attribute;
    uint8_t     nbit;
    uint8_t     sub_index;
    uint32_t    sub_index_ff;
    void*       data_object;
    void*       rw_object;
    
};


struct OD_Object{
    
    uint16_t index;
    void*     data;
    void (*data_func)(struct Data_Object*);
    
};

struct one_type_array{
    
    uint8_t sub_index;
    void*   array;
    
};

struct record_arr_object{
    
    uint8_t  sub_index;
    uint8_t* nbit;    //arr[subindex] = {0x08,0x20....0x10};
    void**   array; //arr[subindex];*uint8,*uint?_t .....
    
};  

struct string_object{
    
    uint8_t*    text;
    uint8_t*    text_buffer;
    uint8_t     n_byte;; 
    uint8_t     cond_sdo;   
};



struct map_info{
    
	uint8_t  nbit; 
	uint8_t  sub_index;
	uint16_t index;
    
};

union  map_data{
    
    uint32_t        data32;
    struct map_info info;
      
};

#define MAX_MAP_DATA 8

/*
 union  cond {
	
    char stat;
    
    struct{
	    
    unsigned sync        : 1; // 0x01 sync
    unsigned new_msg     : 1; // 0x02 new message rxPDO & new send txPDO
    unsigned inhibit_time: 1; // 0x04 0 - pause is over & 1 - set start pause(timer)
    unsigned event_timer : 1; // 0x08 0- off event_timer & 1 - set start event_timer
    unsigned event_txpdo : 1; // 0x10 1 - there is a change to send a message
    unsigned init_pdo    : 1; // 0x20 1 - xPDO init   
    unsigned rx_tx       : 1; // 0x40 0 - rxPDO object, 1 - txPDO
    unsigned lock        : 1; // 0x80 1 - Lock
    
    }flag;     
};
due to the fact that the XC8 is buggy */

#define setSync		*(pdo->cond) |=0x01
#define clrSync		*(pdo->cond) &=0xFE
#define checkSync	*(pdo->cond) & 0x01

#define setNew_msg	*(pdo->cond) |=0x02
#define clrNew_msg	*(pdo->cond) &=0xFD
#define checkNew_msg	*(pdo->cond) & 0x02

#define setInhibit_time   *(pdo->cond) |=0x04
#define clrInhibit_time   *(pdo->cond) &=0xFB
#define checkInhibit_time *(pdo->cond) & 0x04

#define setEvent_timer    *(pdo->cond) |=0x08
#define clrEvent_timer    *(pdo->cond) &=0xF7
#define checkEvent_timer  *(pdo->cond) & 0x08

#define setEvent_txpdo    *(pdo->cond) |=0x10
#define clrEvent_txpdo    *(pdo->cond) &=0xEF
#define checkEvent_txpdo  *(pdo->cond) & 0x10

#define setInit_pdo     *(pdo->cond) |=0x20
#define clrInit_pdo     *(pdo->cond) &=0xDF
#define checkInit_pdo	*(pdo->cond) & 0x20

#define setRx_Tx        *(pdo->cond) |=0x40
#define clrRX_TX	*(pdo->cond) &=0xBF
